In [2]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    [[1, 'foo'], [2, 'bar'], [3, 'baz']], columns=['value', 'id'])

In [3]:
df.head(2)

   value   id
0      1  foo
1      2  bar

In [4]:
df[df['id'].isin(['foo','bar'])]

   value   id
0      1  foo
1      2  bar

In [5]:
df[(df['id'].isin(['foo','bar'])) & (df['value'].isin([1]))]

   value   id
0      1  foo

In [6]:
df[(df['id'].isin(['foo','bar'])) & (df['value'] >= 1)]

   value   id
0      1  foo
1      2  bar

In [9]:
df[(df['id'].isin(['foo','bar'])) & (df['value'] >= 1)].groupby('id')['value'].sum()

id
bar    2
foo    1
Name: value, dtype: int64

In [10]:
## aggregate different column
df = pd.DataFrame({'team': ['A', 'B', 'B', 'B', 'B', 'M', 'M', 'M'],
                   'position': ['G', 'G', 'F', 'G', 'F', 'F', 'C', 'C'],
                   'assists': [5, 7, 7, 8, 5, 7, 6, 9],
                   'rebounds': [11, 8, 10, 6, 6, 9, 6, 10]})

In [11]:
new = df.groupby(['team', 'position']).agg({'assists': ['mean']}).reset_index()

#rename columns 
new.columns = ['team', 'pos', 'mean_assists']

In [12]:
print(new)

  team pos  mean_assists
0    A   G           5.0
1    B   F           6.0
2    B   G           7.5
3    M   C           7.5
4    M   F           7.0

In [15]:
new= df.groupby(['team', 'position']).agg({'rebounds': ['median', 'max']}).reset_index()
new.columns = ['team', 'pos', 'median_rebounds','max_rebounds']

In [16]:
print(new)

  team pos  median_rebounds  max_rebounds
0    A   G               11            11
1    B   F                8            10
2    B   G                7             8
3    M   C                8            10
4    M   F                9             9

In [17]:
new= df.groupby(['team', 'position']).agg({'rebounds': ['median', 'max'], 'assists': ['mean','median']}).reset_index()

In [18]:
print(new)

  team position rebounds     assists
                  median max    mean median
0    A        G       11  11     5.0    5.0
1    B        F        8  10     6.0    6.0
2    B        G        7   8     7.5    7.5
3    M        C        8  10     7.5    7.5
4    M        F        9   9     7.0    7.0

In [19]:
times = ['2020-01-01', '2020-01-03', '2020-01-04', '2020-01-05', '2020-01-29']
s = pd.Series(range(5), index=pd.DatetimeIndex(times))

In [21]:
s

2020-01-01    0
2020-01-03    1
2020-01-04    2
2020-01-05    3
2020-01-29    4
dtype: int64

In [20]:
s.rolling(window=2).sum()

2020-01-01    NaN
2020-01-03    1.0
2020-01-04    3.0
2020-01-05    5.0
2020-01-29    7.0
dtype: float64

In [22]:
df = pd.DataFrame(
    {"x": 1},
    index=[
        pd.Timestamp("20130101 09:00:01"),
        pd.Timestamp("20130101 09:00:02"),
        pd.Timestamp("20130101 09:00:03"),
        pd.Timestamp("20130101 09:00:04"),
        pd.Timestamp("20130101 09:00:06"),
    ],
)

In [27]:
df["right"] = df.rolling("2s", closed="right").x.sum()  # default
print(df)

                     x  right
2013-01-01 09:00:01  1    1.0
2013-01-01 09:00:02  1    2.0
2013-01-01 09:00:03  1    2.0
2013-01-01 09:00:04  1    2.0
2013-01-01 09:00:06  1    1.0

In [28]:
df["left"] = df.rolling("2s", closed="left").x.sum()  # default
print(df)

                     x  right  left
2013-01-01 09:00:01  1    1.0   NaN
2013-01-01 09:00:02  1    2.0   1.0
2013-01-01 09:00:03  1    2.0   2.0
2013-01-01 09:00:04  1    2.0   2.0
2013-01-01 09:00:06  1    1.0   1.0

In [29]:
df = pd.DataFrame(
    {"A": [0, 1, 2, 3, 4]}, index=pd.date_range("2020", periods=5, freq="1D")
)

In [30]:
print(df)

            A
2020-01-01  0
2020-01-02  1
2020-01-03  2
2020-01-04  3
2020-01-05  4

In [37]:
df.rolling("2D").mean()

              A
2020-01-01  0.0
2020-01-02  0.5
2020-01-03  1.5
2020-01-04  2.5
2020-01-05  3.5

In [38]:
df.rolling("2D").mean()

              A
2020-01-01  0.0
2020-01-02  0.5
2020-01-03  1.5
2020-01-04  2.5
2020-01-05  3.5

In [39]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})

In [40]:
df.drop_duplicates()

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [6]:
df = pd.DataFrame({'foo': ['A', 'A', 'A', 'B', 'B', 'B', 'C', 'C', 'C'],
                   'bar': [1, 1, 1, 2, 2, 2, 3, 3, 3],
                   'baz': [11, 12, 13, 14, 15, 16, 17, 18, 19]},
                  index = [14, 15, 16, 17, 18, 19, 20, 21, 22])

In [7]:
df

   foo  bar  baz
14   A    1   11
15   A    1   12
16   A    1   13
17   B    2   14
18   B    2   15
19   B    2   16
20   C    3   17
21   C    3   18
22   C    3   19

In [4]:
df.reset_index(inplace=True)    # This gives us index 0,1,2... and a new col 'index'
df.set_index('baz', inplace=True)    # Replace with date in yours
# This next bit does the groupby and rolling, which will give a df 
# with a multi index of foo and baz, then reset_index(0) to remove the foo index level
# so that it matches the original df index so that you can add it as a new column
df['roll'] = df.groupby('foo')['bar'].rolling(3).sum().reset_index(0,drop=True)
df.reset_index(inplace=True)    # brings baz back into the df as a column
df.set_index('index', inplace=True)   # sets the index back to the original

In [5]:
df = df.drop('column_name', 1) ##drop column

       baz foo  bar  roll
index
14      11   A    1   NaN
15      12   A    1   NaN
16      13   A    1   3.0
17      14   B    2   NaN
18      15   B    2   NaN
19      16   B    2   6.0
20      17   C    3   NaN
21      18   C    3   NaN
22      19   C    3   9.0

In [8]:
import pandas as pd
  
# Initializing the nested list with Data set
age_list = [['Afghanistan', 1952, 8425333, 'Asia'],
            ['Australia', 1957, 9712569, 'Oceania'],
            ['Brazil', 1962, 76039390, 'Americas'],
            ['China', 1957, 637408000, 'Asia'],
            ['France', 1957, 44310863, 'Europe'],
            ['India', 1952, 3.72e+08, 'Asia'],
            ['United States', 1957, 171984000, 'Americas']]
  
# creating a pandas dataframe
df = pd.DataFrame(age_list, columns=['Country', 'Year',
                                     'Population', 'Continent'])
  
# Sorting by column "Population"
df.sort_values(by=['Population'], ascending=False)

         Country  Year   Population Continent
3          China  1957  637408000.0      Asia
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas
2         Brazil  1962   76039390.0  Americas
4         France  1957   44310863.0    Europe
1      Australia  1957    9712569.0   Oceania
0    Afghanistan  1952    8425333.0      Asia

In [9]:
import pandas as pd
data = {'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}
df = pd.DataFrame(data)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [10]:
def addOne(v):
        v += 1
        return v

In [11]:
df['A'] = df['A'].map(addOne) ## APPLY TO ONE COLUMN

In [16]:
import pandas as pd 
age_list = [['Afghanistan', 1952, 8425333, 'Asia'],
            ['Australia', 1957, 9712569, 'Oceania'],
            ['Brazil', 1962, 76039390, 'Americas'],
            ['China', 1957, 637408000, 'Asia'],
            ['France', 1957, 44310863, 'Europe'],
            ['India', 1952, 3.72e+08, 'Asia'],
            ['United States', 1957, 171984000, 'Americas']]
age_list

# creating a pandas dataframe
df = pd.DataFrame(age_list, columns=['Country', 'Year',
                                     'Population', 'Continent'])

In [17]:
df['Country']

0      Afghanistan
1        Australia
2           Brazil
3            China
4           France
5            India
6    United States
Name: Country, dtype: object

In [19]:
def Arab_League (row):
   if   row['Country'] == 'Algeria' :
       return 'Arab_League_MEMBER'       
   elif row['Country'] == 'Bahrain' :
       return 'Arab_League_MEMBER'        
   elif row['Country'] == 'Comoros' :
       return 'Arab_League_MEMBER'       
   elif row['Country'] == 'Djibouti' :
       return 'Arab_League_MEMBER'             
   elif row['Country'] == 'Egypt' :
       return 'Arab_League_MEMBER'        
   elif row['Country'] == 'Iraq' :
       return 'Arab_League_MEMBER'    
   elif row['Country'] == 'Jordan' :
       return 'Arab_League_MEMBER'      
   elif row['Country'] == 'Kuwait' :
       return 'Arab_League_MEMBER'          
   elif row['Country'] == 'Lebanon' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Libya' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Mauritania' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Morocoo' :
       return 'Arab_League_MEMBER'	   
   elif row['Country'] == 'Oman' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'West Bank and Gaza' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Qatar' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Saudi Arabia' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Somalia' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Sudan' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Syria' :
       return 'Arab_League_MEMBER'	   
   elif row['Country'] == 'Tunisia' :
       return 'Arab_League_MEMBER'	   	 
   elif row['Country'] == 'United Arab Emirates' :
       return 'Arab_League_MEMBER'	   	 
   elif row['Country'] == 'Yemen' :
       return 'Arab_League_MEMBER'	   
   elif row['Country'] == 'Eritrea' :
       return 'Arab_League_MEMBER'	
   else :
      return 'Not_In_Arab_League'  
##
      
df['Arab_League'] = df.apply (lambda row: Arab_League (row),axis=1)  

df['Arab_League'].value_counts(sort=False, dropna=False)

Not_In_Arab_League    7
Name: Arab_League, dtype: int64

In [20]:
## lets check NATO membership on abovr dataset using a dictionary

NATO = {'Albania':'NATO','Belgium':'NATO','Bulgaria':'NATO','Canada':'NATO','Croatia':'NATO','Czech Republic':'NATO','Denmark':'NATO','Estonia':'NATO','France':'NATO','Germany':'NATO','Greece':'NATO','Hungary':'NATO','Iceland':'NATO','Italy':'NATO','Latvia':'NATO','Lithuania':'NATO','Luxembourg':'NATO','Netherlands':'NATO','Norway':'NATO','Poland':'NATO','Portugal':'NATO','Romania':'NATO','Slovak Republic':'NATO','Slovenia':'NATO','Spain':'NATO','Turkey':'NATO','United Kingdom':'NATO','United States':'NATO'}

In [32]:
#df.drop('NATO',axis=1)

df['NATO']=df['Country'].map(NATO)
#

In [33]:
df

         Country  Year   Population Continent         Arab_League  NATO
0    Afghanistan  1952    8425333.0      Asia  Not_In_Arab_League   NaN
1      Australia  1957    9712569.0   Oceania  Not_In_Arab_League   NaN
2         Brazil  1962   76039390.0  Americas  Not_In_Arab_League   NaN
3          China  1957  637408000.0      Asia  Not_In_Arab_League   NaN
4         France  1957   44310863.0    Europe  Not_In_Arab_League  NATO
5          India  1952  372000000.0      Asia  Not_In_Arab_League   NaN
6  United States  1957  171984000.0  Americas  Not_In_Arab_League  NATO

In [46]:
df['NATO']=df['NATO'].fillna('Not in NATO')

In [40]:
## probably not wise with big lists
G7 = ['Italy','United States','UK','France','Germany','Japan','Canada'] 
  
# printing original list
print("The original list is : " + str(G7))
  
# initializing K 
K = "G7"
  
# using dictionary comprehension
# + operator used to concat default key and values 
res = {str(ele) : K for ele in G7 }
  
# printing result 
print("The constructed Dictionary : " + str(res))

The original list is : ['Italy', 'United States', 'UK', 'France', 'Germany', 'Japan', 'Canada']
The constructed Dictionary : {'Italy': 'G7', 'United States': 'G7', 'UK': 'G7', 'France': 'G7', 'Germany': 'G7', 'Japan': 'G7', 'Canada': 'G7'}

In [41]:
df['G7']=df['Country'].map(res)

In [42]:
res

{'Italy': 'G7',
 'United States': 'G7',
 'UK': 'G7',
 'France': 'G7',
 'Germany': 'G7',
 'Japan': 'G7',
 'Canada': 'G7'}

In [47]:
df

,Country,Year,Population,Continent,Arab_League,NATO,G7
0,Afghanistan,1952,8425333.0,Asia,Not_In_Arab_League,Not in NATO,Not in G7
1,Australia,1957,9712569.0,Oceania,Not_In_Arab_League,Not in NATO,Not in G7
2,Brazil,1962,76039390.0,Americas,Not_In_Arab_League,Not in NATO,Not in G7
3,China,1957,637408000.0,Asia,Not_In_Arab_League,Not in NATO,Not in G7
4,France,1957,44310863.0,Europe,Not_In_Arab_League,NATO,G7
5,India,1952,372000000.0,Asia,Not_In_Arab_League,Not in NATO,Not in G7
6,United States,1957,171984000.0,Americas,Not_In_Arab_League,NATO,G7

In [44]:
##clean up
df['G7']=df['G7'].fillna('Not in G7')

In [48]:
##Pandas lag, shift create lag values function

df = pd.DataFrame({
    "date": pd.date_range("2020-01-01", freq='D', periods=5),
    "sales": [22, 30, 32, 25, 42]
})

In [52]:
df

        date  sales  diff
0 2020-01-01     22  -8.0
1 2020-01-02     30  -2.0
2 2020-01-03     32   7.0
3 2020-01-04     25 -17.0
4 2020-01-05     42   NaN

In [55]:
df['lag'] =  df.shift(1)['sales']

In [57]:
df['diff']= df['sales']-df.shift(1)['sales']

In [58]:
## we get 1 dat lag value
df

        date  sales  diff   lag
0 2020-01-01     22   NaN   NaN
1 2020-01-02     30   8.0  22.0
2 2020-01-03     32   2.0  30.0
3 2020-01-04     25  -7.0  32.0
4 2020-01-05     42  17.0  25.0

In [59]:
df['diff_pct']= (df['sales']-df.shift(1)['sales'])/df['sales']

In [60]:
df

        date  sales  diff   lag  diff_pct
0 2020-01-01     22   NaN   NaN       NaN
1 2020-01-02     30   8.0  22.0  0.266667
2 2020-01-03     32   2.0  30.0  0.062500
3 2020-01-04     25  -7.0  32.0 -0.280000
4 2020-01-05     42  17.0  25.0  0.404762

In [62]:
df['3_day_momentum']=(df['diff_pct']+df.shift(1)['diff_pct']+df.shift(2)['diff_pct'])/3 ## and so on
df

        date  sales  diff   lag  diff_pct  3_day_momentum
0 2020-01-01     22   NaN   NaN       NaN             NaN
1 2020-01-02     30   8.0  22.0  0.266667             NaN
2 2020-01-03     32   2.0  30.0  0.062500             NaN
3 2020-01-04     25  -7.0  32.0 -0.280000        0.016389
4 2020-01-05     42  17.0  25.0  0.404762        0.062421

In [63]:
#processin dates using pandas
df.reset_index(inplace=True)
df['year'] = df.date.dt.year

In [64]:
df['month'] = df.date.dt.month
df['day'] = df.date.dt.day
df['day of week'] = df.date.dt.dayofweek

In [66]:
df.head(10)

,index,date,sales,diff,lag,diff_pct,3_day_momentum,year,month,day,day of week
0,0,2020-01-01,22,NaN,NaN,NaN,NaN,2020,1,1,2
1,1,2020-01-02,30,8.0,22.0,0.266667,NaN,2020,1,2,3
2,2,2020-01-03,32,2.0,30.0,0.062500,NaN,2020,1,3,4
3,3,2020-01-04,25,-7.0,32.0,-0.280000,0.016389,2020,1,4,5
4,4,2020-01-05,42,17.0,25.0,0.404762,0.062421,2020,1,5,6

In [68]:
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.quarter.html
#add a few more
df['Quarter'] = df.date.dt.quarter
df.head(10)

,index,date,sales,diff,lag,diff_pct,3_day_momentum,year,month,day,day of week,Quarter
0,0,2020-01-01,22,NaN,NaN,NaN,NaN,2020,1,1,2,1
1,1,2020-01-02,30,8.0,22.0,0.266667,NaN,2020,1,2,3,1
2,2,2020-01-03,32,2.0,30.0,0.062500,NaN,2020,1,3,4,1
3,3,2020-01-04,25,-7.0,32.0,-0.280000,0.016389,2020,1,4,5,1
4,4,2020-01-05,42,17.0,25.0,0.404762,0.062421,2020,1,5,6,1

In [70]:
##function lag
## custom lag 
## WeekOfMonth
## Pandas version
print(pd.__version__)
#df['WeekOfMonth'] = df.date.dt.WeekOfMonth
##make sure 1.33 or higher for this
df.head(10)

1.1.4

,index,date,sales,diff,lag,diff_pct,3_day_momentum,year,month,day,day of week,Quarter
0,0,2020-01-01,22,NaN,NaN,NaN,NaN,2020,1,1,2,1
1,1,2020-01-02,30,8.0,22.0,0.266667,NaN,2020,1,2,3,1
2,2,2020-01-03,32,2.0,30.0,0.062500,NaN,2020,1,3,4,1
3,3,2020-01-04,25,-7.0,32.0,-0.280000,0.016389,2020,1,4,5,1
4,4,2020-01-05,42,17.0,25.0,0.404762,0.062421,2020,1,5,6,1

In [71]:
def weekinmonth(dates):
    """Get week number in a month.
    
    Parameters: 
        dates (pd.Series): Series of dates.
    Returns: 
        pd.Series: Week number in a month.
    """
    firstday_in_month = dates - pd.to_timedelta(dates.dt.day - 1, unit='d')
    return (dates.dt.day-1 + firstday_in_month.dt.weekday) // 7 + 1

In [79]:
##returns a series not a value see above apply returns a value

df['weekinmonth']=weekinmonth(df['date'])